; domain
(define (domain zeno-travel)
(:requirements :typing)
(:types aircraft person - locatable
	locatable city flevel - object)
(:predicates (at ?x - locatable ?c - city)
             (in ?p - person ?a - aircraft)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 ?l2 - flevel))


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)))

(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 - flevel)
 
 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l2)))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 ?l3 - flevel)

 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1)
		 (next ?l3 ?l2)
		)
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l3)
	)
) 

(:action refuel
 :parameters (?a - aircraft ?c - city ?l - flevel ?l1 - flevel)

 :precondition (and (fuel-level ?a ?l)
                 (next ?l ?l1)
                 (at ?a ?c))
 :effect (and (fuel-level ?a ?l1) (not (fuel-level ?a ?l))))


)

; problem
(define (problem ZTRAVEL-2-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city2)
	(fuel-level plane1 fl0)
	(at plane2 city1)
	(fuel-level plane2 fl0)
	(at person1 city4)
	(at person2 city4)
	(at person3 city1)
	(at person4 city3)
	(at person5 city1)
	(at person6 city1)
	(at person7 city2)
	(at person8 city2)
	(at person9 city4)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane2 city0)
	(at person1 city4)
	(at person2 city1)
	(at person3 city1)
	(at person4 city2)
	(at person5 city1)
	(at person6 city2)
	(at person7 city3)
	(at person8 city0)
	(at person9 city1)
	))

)

; plan
1. (refuel plane2 city1 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 3 of 10
2. (refuel plane2 city1 fl1 fl2)
   deleted: (fuel-level plane2 fl1)
   added: (fuel-level plane2 fl2)
   goals met: 3 of 10
3. (refuel plane2 city1 fl2 fl3)
   deleted: (fuel-level plane2 fl2)
   added: (fuel-level plane2 fl3)
   goals met: 3 of 10
4. (refuel plane2 city1 fl3 fl4)
   deleted: (fuel-level plane2 fl3)
   added: (fuel-level plane2 fl4)
   goals met: 3 of 10
5. (refuel plane1 city2 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 3 of 10
6. (board person6 plane2 city1)
   deleted: (at person6 city1)
   added: (in person6 plane2)
   goals met: 3 of 10
7. (fly plane2 city1 city2 fl4 fl3)
   deleted: (at plane2 city1) (fuel-level plane2 fl4)
   added: (at plane2 city2) (fuel-level plane2 fl3)
   goals met: 3 of 10
8. (debark person6 plane2 city2)
   deleted: (in person6 plane2)
   added: (at person6 city2)
   goals met: 4 of 10
9. (board person8 plane2 city2)
   deleted: (at person8 city2)
   added: (in person8 plane2)
   goals met: 4 of 10
10. (board person7 plane2 city2)
   deleted: (at person7 city2)
   added: (in person7 plane2)
   goals met: 4 of 10
11. (fly plane2 city2 city3 fl3 fl2)
   deleted: (at plane2 city2) (fuel-level plane2 fl3)
   added: (at plane2 city3) (fuel-level plane2 fl2)
   goals met: 4 of 10
12. (fly plane1 city2 city4 fl1 fl0)
   deleted: (at plane1 city2) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 4 of 10
13. (debark person7 plane2 city3)
   deleted: (in person7 plane2)
   added: (at person7 city3)
   goals met: 5 of 10
14. (board person9 plane1 city4)
   deleted: (at person9 city4)
   added: (in person9 plane1)
   goals met: 5 of 10
15. (board person4 plane2 city3)
   deleted: (at person4 city3)
   added: (in person4 plane2)
   goals met: 5 of 10
16. (board person2 plane1 city4)
   deleted: (at person2 city4)
   added: (in person2 plane1)
   goals met: 5 of 10
17. (fly plane2 city3 city2 fl2 fl1)
   deleted: (at plane2 city3) (fuel-level plane2 fl2)
   added: (at plane2 city2) (fuel-level plane2 fl1)
   goals met: 5 of 10
18. (debark person4 plane2 city2)
   deleted: (in person4 plane2)
   added: (at person4 city2)
   goals met: 6 of 10
19. (fly plane2 city2 city0 fl1 fl0)
   deleted: (at plane2 city2) (fuel-level plane2 fl1)
   added: (at plane2 city0) (fuel-level plane2 fl0)
   goals met: 7 of 10
20. (debark person8 plane2 city0)
   deleted: (in person8 plane2)
   added: (at person8 city0)
   goals met: 8 of 10
21. (refuel plane1 city4 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 8 of 10
22. (fly plane1 city4 city1 fl1 fl0)
   deleted: (at plane1 city4) (fuel-level plane1 fl1)
   added: (at plane1 city1) (fuel-level plane1 fl0)
   goals met: 8 of 10
23. (debark person2 plane1 city1)
   deleted: (in person2 plane1)
   added: (at person2 city1)
   goals met: 9 of 10
24. (debark person9 plane1 city1)
   deleted: (in person9 plane1)
   added: (at person9 city1)
   goals met: 10 of 10
